       identification division.
       program-id. sync.
       author. gonzo.
       data division.
       working-storage section.
           01 total-money pic S9(4)V99 comp sync right
       procedure division.
          